package com.seongjun.section03.constant;

public class Applicaion1 {

    public static void main(String[] args) {

        /* 목표. 성수에 대해 이해하고 사용 */
        /* 상수란
         * 변하지 않는 값을(고정된 값) 저장해두기 위한 메모리상의 공간
         * 변수와 상반되는 개념
         *
         * 목적
         * 변경되지 않는 고정된 값을 저장
         * 초기화 이후 값 대입 . 컴파일 에러를 발생시켜 값이 수정되지 못하게 해줌
         *
         *
         * 사용방법
         *  1. 상수를 선언한다. (변수 선언과 유사하지만 final 키워드를 사용함)
         *  2. 값을 초기화 한다. (초기화 이후에는 값 변경 불가능함)
         *  3. 필요한 위치에 상수를 호출해서 사용한다.
         * */

        /* 목차. 1. 상수 선언 */
        /* 상수 선언 시 자료형 앞에 final 키워드를 붙인다. */
        final int AGE;

        /* 목차. 2. 초기화 */
        AGE = 20;
        //AGE = 30;		//초기화 후 재대입 불가능

        /* 목차. 3. 필요한 위치에 상수를 호출해서 사용한다. */
        /* 목차. 3-1. 출력 구문에서 사용 */
        System.out.println("AGE의 값 : " + AGE);

        /* 목차. 3-2. 필요시 연산식에 호출해서 사용 */
        System.out.println("AGE의 2배 : " + (AGE * 2));

        /* 목차. 3-3. 대입연산시 활용 */
        int sum = AGE;				//대입 연산자의 오른 편에는 기술 가능함
        //int AGE = AGE + 10;		//변수일땐 가능하지만 상수는 불가능
    }
}
